abdulsamedkara/iot-project-final-v1/sdkconfig.defaults
# ─── Target ───────────────────────────────────────────────────────────────────
CONFIG_IDF_TARGET="esp32s3"

# ─── ESP32-S3 N16R8: 16MB Flash, Octal PSRAM ─────────────────────────────────
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y

# ─── Partition Table ──────────────────────────────────────────────────────────
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ─── Stack / Task ─────────────────────────────────────────────────────────────
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# ─── WiFi ─────────────────────────────────────────────────────────────────────
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8

# ─── WebSocket ────────────────────────────────────────────────────────────────
CONFIG_WS_BUFFER_SIZE=8192

# ─── mbedTLS (AES-256) ────────────────────────────────────────────────────────
CONFIG_MBEDTLS_AES_C=y
CONFIG_MBEDTLS_HARDWARE_AES=y

# ─── LVGL Font ────────────────────────────────────────────────────────────────
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_COMPILER_OPTIMIZATION_NONE=y
CONFIG_LV_MEM_CUSTOM=y
